Revit 2024 API
AssetPropertyList.AddNewAssetPropertyDouble Method
 Adds a new AssetPropertyDouble containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public void AddNewAssetPropertyDouble(
	double value
)
Visual Basic
Public Sub AddNewAssetPropertyDouble ( _
	value As Double _
)
Visual C++
public:
void AddNewAssetPropertyDouble(
	double value
)
Parameters
value
Type: System.Double
 The double value to add.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The asset property is not editable.
See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace